{
    "camera_gear": {
        "model": "Sony A7R V or Phase One IQ4 150MP",
        "lens": "Canon TS-E 24mm f/3.5L II (adapted) or Sony FE 24-70mm GM II (at 35mm)",
        "sensor": "Full Frame 61MP BSI CMOS or Medium Format",
        "shutter_speed": "1/10 sec to 1/15 sec (slow shutter to create motion blur on passing vehicles)",
        "aperture": "f/11 (to ensure edge-to-edge sharpness and create sunstar effect on specular highlights)"
    },
    "lighting_setup": {
        "time_of_day": "Golden Hour (Late Afternoon, approx. 1 hour before sunset)",
        "weather": "Sunny with scattered clouds, clear visibility",
        "lighting_direction": "Direct Western Backlight/Sidelight (Contre-jour), creating a massive specular reflection on the building facade",
        "quality": "Sky Gradient: A smooth diagonal gradient from Steel Blue (#4682B4) in the top-left zenith fading into a hazy Pale Cyan (#E0FFFF) towards the horizon. High-contrast directional light mixed with soft cool ambient fill in shadows ",
        "artificial_light": "Mixed color temperature: 2700K sodium vapor street lighting, 4000K LED building illumination, 5600K neutral signage backlights"
    },
    "architectural_lighting": {
        "interior_illumination": "Minimal visibility, overpowered by the exterior reflection",
        "exterior_facade_effects": "Blinding sunburst reflection on the glass. Color codes: Solar Glint #FFF8E1 (Pale Gold) transitioning to #FFAE00 (Vivid Orange) and #D35400 (Pumpkin) on the glass mullions."
    },
    "landscape_lighting": {
        "hardscape_illumination": "Color codes: #2C3E50 (Dark Slate Blue) and #34495E (Cool Grey) reflecting the zenith sky, contrasting with the warm building.",
        "vegetation_highlighting": "Sun-drenched tree canopies, Deep shadows beneath trees, White lane markings"
    },
    "color_grading": {
        "palette": "Strong Complementary Contrast: Burning Gold/Orange (#FF8C00) highlights vs. Cool Slate Blue/Cyan (#2E4053) shadows",
        "saturation": "High saturation in the orange spectrum, desaturated cool tones in the shadows",
        "contrast": "High Dynamic Range (HDR) look, preserving details in the blinding highlight while maintaining deep blacks in the foreground cars"
    },
    "texture_quality": {
        "details": "Motion blur streaks of vehicles",
        "surface_descriptions": "Highly reflective glazing acting as a mirror, matte asphalt absorbing light",
        "ground_surface": "Asphalt texture visible but softened by motion blur and shadow, cool blue cast",
        "foliage_style": "Dormant or sparse, providing scale"
    },
    "composition_guide": {
        "type": "Wide-angle street view, two-point perspective",
        "balance": "Asymmetrical balance"
    },
    "atmosphere": {
        "mood": "Energetic, dynamic, blindingly bright yet urbanely cool",
        "feeling": "The rush of the city at the end of the workday, modern efficiency, architectural brilliance"
    },
    "technical_quality": {
        "post_processing": "Highlight compression to retain sunburst detail, cool toning in shadows (Split Toning), motion blur enhancement",
        "white_balance": "Daylight (5600K) adjusted to let shadows drift blue while highlights remain intensely warm",
        "tone": "High contrast S-Curve, crushed blacks in the car undercarriages",
        "vignette": "Subtle darkening at the bottom corners to frame the road",
        "dynamic_range": "14 stops, critical retention of highlight data in the sun reflection"
    }
}